; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block name)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       (name ?x - block ?y - name)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y))))
(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)

)

; problem
(define (problem BLOCKS)
(:domain BLOCKS)
(:objects A E P S T H Y O G D C L R I B - block)
(:INIT   (ONTABLE A)
         (ON B A)
         (CLEAR O) (ON O B)
         (ON E P)
         (ON I E) (CLEAR I)
         (ONTABLE P)
         (ONTABLE S)
         (ON T S) 
         (CLEAR T)
         (ONTABLE Y)
         (ON L Y) (CLEAR L) 
         (ONTABLE G) 
         (ON R G)(CLEAR R)
         (ONTABLE C) 
         (CLEAR C)
         (ONTABLE D)
         (CLEAR H) (ON H D)
         (HANDEMPTY)
)
(:goal (AND 
        (ONTABLE T)
        (ON S T)
        (ON A S)
        (ON E A)
        )
    )
)

; plan
1. (unstack i e)
   deleted: (clear i) (handempty) (on i e)
   added: (holding i) (clear e)
   goals met: 0 of 4
2. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 0 of 4
3. (unstack o b)
   deleted: (clear o) (handempty) (on o b)
   added: (holding o) (clear b)
   goals met: 0 of 4
4. (stack o h)
   deleted: (holding o) (clear h)
   added: (clear o) (handempty) (on o h)
   goals met: 0 of 4
5. (unstack t s)
   deleted: (clear t) (handempty) (on t s)
   added: (holding t) (clear s)
   goals met: 0 of 4
6. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 1 of 4
7. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 1 of 4
8. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 1 of 4
9. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 1 of 4
10. (stack s t)
   deleted: (holding s) (clear t)
   added: (clear s) (handempty) (on s t)
   goals met: 2 of 4
11. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 2 of 4
12. (stack a s)
   deleted: (holding a) (clear s)
   added: (clear a) (handempty) (on a s)
   goals met: 3 of 4
13. (unstack e p)
   deleted: (clear e) (handempty) (on e p)
   added: (holding e) (clear p)
   goals met: 3 of 4
14. (stack e a)
   deleted: (holding e) (clear a)
   added: (clear e) (handempty) (on e a)
   goals met: 4 of 4
